# 1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11


# a = input('Введите вещественное число a: ')
# sum = 0
# for i in a:
#     if i != '.' and i != ',' and i != '-':
#         sum += int(i)
# print(sum)

# или

# print(sum([int(i) for i in input() if i.isdigit()]))


########################################################################################################

# 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# N = int(input())
# p = 1
# for i in range(1, N):
#     p *= i
#     print(p, end=', ')
# print(p*N)

# или 

# N = int(input())
# fact = 1
# some_list = []
# for i in range(1, N+1):
#     some_list.append(fact*i)
#     fact *= i
# print(some_list)


########################################################################################################

# 3. Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.

# n = int(input())
# summ = 0
# for i in range(1, n+1):
#     summ += (1+1/i)**i
# print(summ)


#########################################################################################################


# 4. Задайте список из N элементов, заполненных числами из промежутка [-N, N]. Найдите произведение элементов 
# на указанных позициях. Позиции хранятся в файле file.txt в одной строке одно число.

# from random import *
# n = int(input())

# some_list = [randint(-n, n) for _ in range(randint(5, 10))]
# print(some_list)

# f = open('17.txt', 'w')
# for i in range(randint(2, len(some_list))):
#     f.write(str(randint(0, len(some_list)-1)) + '\n')
# f.close()

# pr = 1
# with open('17.txt', 'r') as f:
#     for i in f.read().splitlines():
#         pr = pr * some_list[int(i)]
# print(pr)


##############################################################################################################################


# 5. Реализуйте алгоритм перемешивания списка.

# list = [3, 8, 9, 0, 2]
# print(list) 
# import random
# random.shuffle(list)
# print(list) 